<script lang='ts' setup>

</script>

<template>
  <div class="w-screen h-screen bg-[#F5F6F8] py-5">
    <div class="flex  text-xs flex-col gap-3 p-5 w-[90vw] bg-white rounded-lg card-shadow mx-auto">
      <p>感谢您使用“HfutSpace”(以下皆简称 “课表”)的服务，我们非常重视用户们的隐私保护及使用体验，课表会充分尊重用户们的隐私权并虚心听取用户们对课表的改进意见。在使用本课表之前，我们建议您阅读《“HfutSpace”用户协议》(以下皆简称“《协议》”)中约定的各项条款内容。如在登录的时候点击了登录按钮，即表示您同意本《协议》条款.的所有内容，并同意并接受本《协议》各项条款的约良。</p>

      <p class="text-base font-semibold">
        一、 服务内容
      </p>

      <p>1.1“HfutSpace” 是由HfutSpace项目组开发发是一个面向合肥工业大学宣城校区、屯溪路校区、翡翠湖校区三区全覆盖的一站式学生服务类微信小程序，合肥工业大学学生可使用教务系统账号及密码登录使用。课表的具体服务内容由HfutSpace项目组根据实际情况提供。</p>

      <p>1.2您一旦在课表登录， 将视为您同意本协议,您需要对自已在课表的所有活动和操作负责。如出现由于您的失误或者发布非真实信，息等情况，则由此导致的针对您、HfutSpace项目组或者第三方造成的损失，您将自行承担全部责任。</p>

      <p>1.3如果您在使用课表的相关服务时与第三方发生任何纠纷，请您与第三方直接联系，HfutSpace项目组不承担任何责任，但会根据实际情况依法提供必要的协</p>

      <p class="text-base font-semibold">
        二、用户使用规范
      </p>

      <p>2.1您在使用课表相关服务时，必须使用准确的小程序资H如小程序资料有任何变动，必须及时更新。因您提供小程序资料不准确、不真实或不完整而引发的一-切后果由用户承担。</p>

      <p>2.2 如您发现其账号遭他人非法盗用，应立即通知HfutSpace项目组。因黑客行为导致小程序遭他人非法改或使用你您应及时通知HfutSpace项目组，项目组将采取力所能及的措施避免损失的扩大，否则HfutSpace项目组有权拒绝承担任何责任。</p>

      <p>2.3您在使用课表相关服务过程中,必须遵守以下原则:2.3.1遵守中华人民共和国相关法律法规的规定:</p>

      <p>2.3.2不得侵犯HfutSpace项目组的专利权、著作权、商标权、名誉权等其他合法权益;</p>

      <p>2.3.3 不得利用课表服务进行任何不利于HfutSpace项目组或者其他第三方的行为;</p>

      <p>2.3.4 如您在使用网络服务时违反上述任何规定，HfutSpace项目组有权要求您修正或直接采取一切必要的措施(包括但不限于更改或删除、屏蔽相关内容、暂停或终止您使用课表服务的权利)以减轻用户不当行为造成的影响</p>

      <p>2.3.5 因您违反本条约定或相关法律法规，导致任何第三方遭受损失的，您应当独立承担担责任;HfutSpace项目组因此遭受的损失，您也需要负责。</p>

      <p class="text-base font-semibold">
        三、隐私政策
      </p>

      <p>3.1本课表尊重并保护所有用户的个人隐私权。为了给您提供更准确的服务，本课表会按照本隐私政策的规定使用您的个人信息。除本隐私政策另有规定外，在未征得您事先许可的情况下，本课表不会将这些信息对外披露或向第三方提供。本课表会不时更新本隐私政策。</p>

      <p>3.2适用范围</p>

      <p>3.2.1在您登录课表时，您根据本课表要求提供的个人信息和使用过程中自动记录的信，息。(包括但不限于用户姓名、学号、学院、专业、班级,信息门户密码，成绩，课程情况等信息)</p>

      <p>3.3信息使用</p>

      <p>3.3.1本课表不会向任何无关第三方提供、出售、出租、分享或交易您的个人信息,除非事先得到您的许可。</p>

      <p>3.3.2 本课表亦不允许任何第三方以任何手段收集、编辑、出售或者传播您的个人信息。任何本课表用户如从事上述活动，一-经发现， 本课表有权立即终止与该用户的服务协</p>

      <p>3.4信息披露</p>

      <p>在如下情况下，本课表将依据您的个人意愿或法律的规定全部或部分的披露您的个人信息:</p>

      <p>3.4.1 经您事先同意，向第三方披露;</p>

      <p>3.4.2 为提供您所需要的服务,而必须和第三方分享您的个人信息;</p>

      <p>3.4.3 根据法律法规规定要求、法律程序、诉讼或公共机构和政府部门依法提出的要求，HfutSpace项目组可能有必要披露您的个人信息。如果我们确定就国家安全、执法或具有公共重要性的其他事宜而言,披露是必须或适当的，我们也可能会披露关于您的信息;</p>

      <p> 3.4.4如您出现违反中华人民共和国相关法律、法规或者本课表服务协议或相关规则的情况，需要向第三方披露;3.4.5其它本应用根据法律、法规或者政策认为合适的披露。</p>

      <p class="text-base font-semibold">
        四、知识产权
      </p>

      <p>4.1HfutSpace项目组在本服务中提供的内容(包括但不限于文本、图片等)的知识产权HfutSpace项目组所有。</p>

      <p>4.2课表的一切权利均属于 HfutSpace项目组,未经HfutSpace项目组许可，用户不得对该程序进行反向工程、反向编译或反汇编, 或者用于其他任何目</p>

      <p>
        4.3小程序授权范围
      </p><p>4.3.1 用户可以在个人计算机或手机上使用、显示、运行本程序。</p>

      <p>4.3.2 保留权利:未明示授权的其他-切权利仍归HfutSpace项目组所有，用户使用其他权利时须另外取得项目组的书面同意。</p>

      <p>4.3.3 除《协议》有明确规定外，对于另外的相关服务有可能有单独的服务条款加以规范，请用户在使用有关服务时另行了解与确认。</p>

      <p class="text-base font-semibold">
        五、免责声明
      </p>

      <p>5.1HfutSpace项目组不担保网络服务-定能满足用户的要求，也不担保网络服务不会中断，对网络服务的及时性、安全性、准确性也都不作担保。</p>

      <p>5.2对于因电信系统或互联网网络故障、计算机故障或病毒、信息损坏或丢失、计算机系统问题或其它任何不可抗力原因而产生的损失，HfutSpace项目组不承担任何责任，但将尽力减少因此而给用户造成的损失和影响。</p>

      <p class="text-base font-semibold">
        六、附则.
      </p>

      <p>6.1本协议的订立、执行和解释及争议的解决均应适用中华人民共和国相关法律、法规。</p>

      <p>6.2如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束</p>

      <p>6.3本协议解释权及修订权归HfutSpace项目组所有。</p>
    </div>
  </div>
</template>

<style lang='scss' scoped>

</style>
